<?php
return [
    'channel' => [
        '1' => [
            'name' => '易联',
            'code' => 'yilian',
            'status' => - 1
        ],
        '2' => [
            'name' => '易宝',
            'code' => 'yibao',
            'status' => 1
        ]
    ],
    //卡类型
    'sexItems' => [
        '1' => '男',
        '2' => '女',
        '3'=>'保密'
    ],
    //用户推送设置
    'userPush' => [
        '1' => '允许',
        '-1' => '不允许',
    ],

    //用户和代理实名认证
    'userAuth' => [
        '-1' => '未认证',
        '1' => '已通过',
    ],
    //用户和代理使用状态
    'userState' => [
        '1' => '正常',
        '-1' => '禁用',
    ],
    //信用卡和储蓄卡状态
    'cardStatus' => [
        '1' => '正常',
        '-1' => '已删除',
        '2' =>'未验卡'
    ],
    //卡类型
    'cardType' => [
        '1' => '信用卡',
        '2' => '储蓄卡',
    ],
    //用户或代理账户入库方式
    'InStatus' => [
        '1' => '自动',
        '2' => '手动',
    ],
    //绑卡记录状态
    'bindcardStatus' => [
    	'-2' => '支付异常',
        '1' => '成功',
        '2' => '失败',
    	'3' => '待处理'
    ],
    //计划完成方式
    'planFinishType' => [
        '1' => '自动',
        '2' => '强制',
    ],
    //计划状态
    'planStatus' => [
        '1' => '未开始',
        '2' => '进行中',
		'3' => '已完成'
    ],
    //计划详情的类型
    'planlistType' => [
        '1' => '还款',
        '2' => '消费',
        '3' => '提现',
        '4' => '充值',
        '5' => '卡验证',
        '6' => '余额平账',
        '7' => '强制扣款',
        '8' => '收款',
    	'9' => '红包',
    	'10' => '购买邀请码'	
    ],
    //计划详情的状态
    'planlistStatus' => [
        '1' => '未执行',
        '2' => '进行中',
        '3' => '已完成',
        '4' => '暂停',
        '5' => '成功',
        '6' => '失败',
    ],
    //邀请码状态
    'inviteCodeStatus' => [
        '1' => '已入库',
        '2' => '已下发',
        '3' => '已使用'
    ],
    //客户类型
      'user_type' => [
        '1' => '用户',
        '2' => '代理',
    ],
            //信息级别
      'type' => [
        '1' => '紧急',
        '2' => '重要',
        '3' => '一般',
    ],
    // 消息发送状态
    'read_unread' => [
        '1' => '已读',
        '2' => '未读',        
    ],
        // 消息模板状态

];